[
	{
		"id": "http://zotero.org/users/local/1zHodGHj/items/TBQVAMG2",
		"type": "article-journal",
		"abstract": "É dentro do contexto de especificidades territoriais que emerge a problemática da pesquisa discorrida. Pois, pela condição inicialmente favorável do recorte urbano de Maceió - Alagoas, a atividade de extração de sal-gema foi instaurada na região. Assim, objetivou-se caracterizar a atividade extrativista de sal-gema realizada em Maceió, apontando as principais problemáticas vivenciadas pela população dos bairros Pinheiro, Bebedouro e Mutange, bem como entender a lógica do discurso reproduzido pela instituição operadora da extração. Deste modo, foram realizadas pesquisas bibliográficas e documentais na tentativa de montar um arcabouço teórico sobre a temática, abordando as diferentes concepções da natureza e a influência do capital nas relações socioespaciais. Considerou-se, então, que a atividade mineral desempenhada no território urbano visou à maximização do lucro e não acompanhou a lógica de sustentabilidade reproduzida no discurso ambientalista da empresa. Somado a isso, constatou-se que a realização da atividade propagou impactos socioambientais e econômicos para a população inserida na área analisada.",
		"container-title": "Revista Movimentos Sociais e Dinâmicas Espaciais",
		"DOI": "10.46802/rmsde.v9i1.243613",
		"ISSN": "2238-8052",
		"issue": "1",
		"journalAbbreviation": "RMSDE",
		"note": "number: 1",
		"page": "27",
		"source": "DOI.org (Crossref)",
		"title": "A lógica do discurso ambientalista empresarial: da extração de sal-gema aos impactos no ambiente urbano",
		"title-short": "A lógica do discurso ambientalista empresarial",
		"URL": "https://periodicos.ufpe.br/revistas/revistamseu/article/view/243613",
		"volume": "9",
		"publisher": {
			"name": "Periódicos UFPE",
			"url": "https://periodicos.ufpe.br/"
		},
		"author": [
			{
				"family": "Teixeira",
				"given": "Arthur Felipe de Melo"
			},
			{
				"family": "Nascimento",
				"given": "Carlos Henrique de Vasconcelos"
			},
			{
				"family": "Silva",
				"given": "Clayton Dos Santos"
			},
			{
				"family": "Lima",
				"given": "Jessé Rafael Bento",
				"dropping-particle": "de"
			},
			{
				"family": "Fragoso",
				"given": "Marília Lacerda Barbosa"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2023",
					3,
					18
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2020",
					6,
					30
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/1zHodGHj/items/EP7AKFTJ",
		"type": "article-journal",
		"container-title": "Educational Psychology Review",
		"DOI": "10.1007/s10648-020-09592-4",
		"ISSN": "1040-726X, 1573-336X",
		"issue": "4",
		"journalAbbreviation": "Educ Psychol Rev",
		"language": "en",
		"page": "1583-1630",
		"source": "DOI.org (Crossref)",
		"title": "A Comprehensive Review of Educational Technology on Objective Learning Outcomes in Academic Contexts",
		"URL": "https://link.springer.com/10.1007/s10648-020-09592-4",
		"volume": "33",
		"publisher": {
			"name": "Springer Link",
			"url": "https://link.springer.com/"
		},
		"author": [
			{
				"family": "Yeung",
				"given": "Kam Leung"
			},
			{
				"family": "Carpenter",
				"given": "Shana K."
			},
			{
				"family": "Corral",
				"given": "Daniel"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2023",
					5,
					20
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2021",
					12
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/1zHodGHj/items/SIZADJYC",
		"type": "article-journal",
		"abstract": "O uso das tecnologias no contexto escolar tem a finalidade de desenvolver no aluno melhores condições de aprendizado e conhecimento, assimilação do conteúdo de forma mais clara, objetiva e consistente. Assim, esse estudo objetivou reunir e analisar, por meio de uma revisão de literatura, a utilização da tecnologia na educação, sua evolução histórica e aplicação nos diferentes níveis de ensino. Sabe-se que o desenvolvimento das tecnologias no sistema educacional promoveu a modernização do ensino, otimizando os processos educativos para melhorar a aprendizagem através das mudanças, as quais consistem em um desafio para a educação até os dias atuais. Além disso, os recursos disponibilizados pela tecnologia digital constituem-se num importante método para que as pessoas com deficiência se tornem sujeitos ativos no processo de construção de conhecimento. No entanto um dos maiores problemas está na inserção dessas tecnologias, no momento certo e de maneira adequada, bem como, a formação continuada de docentes.",
		"container-title": "Educere - Revista da Educação da UNIPAR",
		"DOI": "10.25110/educere.v20i2.2020.7439",
		"ISSN": "1982-1123",
		"issue": "2",
		"journalAbbreviation": "Educere",
		"source": "DOI.org (Crossref)",
		"title": "TECNOLOGIA NA EDUCAÇÃO: EVOLUÇÃO HISTÓRICA E APLICAÇÃO NOS DIFERENTES NÍVEIS DE ENSINO",
		"title-short": "TECNOLOGIA NA EDUCAÇÃO",
		"URL": "https://www.revistas.unipar.br/index.php/educere/article/view/7439",
		"volume": "20",
		"publisher": {
			"name": "Revistas Unipar",
			"url": "https://www.revistas.unipar.br/"
		},
		"author": [
			{
				"family": "Klein",
				"given": "Danieli Regina"
			},
			{
				"family": "Sanches Canevesi",
				"given": "Fernanda Cristina"
			},
			{
				"family": "Feix",
				"given": "Angela Regina"
			},
			{
				"family": "Parreira Gresele",
				"given": "Jizéli Fonseca"
			},
			{
				"family": "Wilhelm",
				"given": "Elizane Maria De Siqueira"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2023",
					5,
					20
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2020",
					9,
					28
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/1zHodGHj/items/8YYWZP8U",
		"type": "article-journal",
		"abstract": "The Information Society and Knowledge brings with it an increase in the number of information systems and objects with high complexity in use. It is up to designers built them to help the user to perform the desired task, without getting hurt. However, there is a high number of accidents caused by lack of usability. This study examines these seven cases, indicating theories to their causes and suggesting some solutions to the problems discussed in order to promote a reflection on the lack of usability of the new systems.",
		"issue": "1",
		"ISSN": "1984-3151",
		"language": "pt",
		"source": "Zotero",
		"title": "MACHUCABILIDADE: A FALTA DE DESIGN DE USABILIDADE PODE MACHUCAR O USUÁRIO",
		"volume": "2",
		"publisher": {
			"name": "Revistas UniBH",
			"url": "www.unibh.br/revistas/exacta"
		},
		"author": [
			{
				"family": "Pereira",
				"given": "Moisés Henrique Ramos"
			},
			{
				"family": "Carvalho",
				"given": "Ana Paula",
				"non-dropping-particle": "de"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2009"
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/1zHodGHj/items/GUXFLF3X",
		"type": "article-journal",
		"container-title": "Trends in Cognitive Sciences",
		"DOI": "10.1016/j.tics.2020.11.009",
		"ISSN": "13646613",
		"issue": "3",
		"journalAbbreviation": "Trends in Cognitive Sciences",
		"language": "en",
		"page": "200-212",
		"source": "DOI.org (Crossref)",
		"title": "Mind Meets Machine: Towards a Cognitive Science of Human–Machine Interactions",
		"title-short": "Mind Meets Machine",
		"URL": "https://linkinghub.elsevier.com/retrieve/pii/S1364661320302977",
		"volume": "25",
		"publisher": {
			"name": "Elsevier",
			"url": "https://www.elsevier.com/pt-br"
		},
		"author": [
			{
				"family": "Cross",
				"given": "Emily S."
			},
			{
				"family": "Ramsey",
				"given": "Richard"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2023",
					7,
					2
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2021",
					3
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/1zHodGHj/items/47MHLTZ8",
		"type": "article-journal",
		"abstract": "Resumo\n\t\t\t\t\tO objetivo deste artigo é caracterizar o processo de plataformização das transmissões esportivas nas plataformas de streaming HBO Max, Amazon Prime Video e Star +. Para tanto, aborda plataformas digitais, plataformização e transmissões esportivas em plataformas de streaming por meio de pesquisa bibliográfica, documental e estudo de casos múltiplos. As categorias de análise são infraestrutura de dados, mercados, governança, práticas e affordances e conteúdo. Percebe-se que essas plataformas atuam como distribuidoras das transmissões esportivas, submetendo-se, para tanto, à questão de direitos de imagem de clubes e a anunciantes de canais de terceiros. Esse tipo de conteúdo é, por isso, menos sujeito à dataficação e à governança determinados pela plataforma do que outros produtos audiovisuais disponibilizados por elas.",
		"container-title": "Revista Dispositiva",
		"DOI": "10.5752/P.2237-9967.2023v12n21p169-190",
		"ISSN": "2237-9967",
		"issue": "21",
		"language": "pt",
		"license": "Copyright (c) 2023 Dispositiva",
		"note": "number: 21",
		"page": "169-190",
		"source": "periodicos.pucminas.br",
		"title": "CAMPEONATO DAS PLATAFORMAS NO BRASIL: UMA ANÁLISE DAS TRANSMISSÕES DE FUTEBOL NA HBO MAX, AMAZON  PRIME VIDEO E STAR+",
		"title-short": "Campeonato das plataformas",
		"URL": "http://periodicos.pucminas.br/index.php/dispositiva/article/view/29509",
		"volume": "12",
		"publisher": {
			"name": "Periódicos PUC Minas",
			"url": "http://periodicos.pucminas.br/"
		},
		"author": [
			{
				"family": "Sperb",
				"given": "Felipe"
			},
			{
				"family": "Valiati",
				"given": "Vanessa"
			},
			{
				"family": "Montardo",
				"given": "Sandra"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2023",
					7,
					15
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2023",
					3,
					25
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/1zHodGHj/items/JKGNQFBD",
		"type": "article-journal",
		"abstract": "Digital products are designed based on user needs and this process has phases of interaction\r\nbetween the target audience and the people involved in the project, such as user experience\r\nand user interface designers. The elderly have several limitations that affect the cognitive\r\naspect due to age, being common especially for those who are not familiar with mobile\r\ndevices, for example, requesting help from a second person to solve a task. This public,\r\nespecially the elderly, maintains a constant population increase, reaching the mark of 30.2\r\nmillion in 2017, according to the Continuous National Household Sample Survey -\r\nCharacteristics of Residents and Households, according to IBGE, 2018. The relevance of the\r\nincreased population of these users is sometimes not considered in digital product projects,\r\nmaking it difficult to understand, use and learn about this audience. The following work has\r\nas its main objective to evaluate the usability of a digital product, with a focus on health and\r\nwell-being, to identify and propose usability recommendations that can benefit other digital\r\nproducts, to facilitate the cognitive process of this audience, ensure greater digital inclusion.\r\nThe initial method of the research started from an analysis of the existing works related to this\r\ntheme of usability recommendations and proportions of creation of web components with a\r\nfocus on the elderly. The design methodology is proposed by Garrett (2011), with a focus on\r\ninterface design and user experience, in his book “The Elements of User Experience” (2011).\r\nThis work intends to contribute to the digital inclusion of the elderly public, as applications\r\nand social networks are extremely attractive and can help connect people who are far away.\r\nThis work intends to contribute to the collection that deals with this topic, as the literature still\r\noffers usability guidelines on examples and interface recommendations (BARROS et al,\r\n2014).",
		"language": "pt_BR",
		"note": "Accepted: 2022-09-26T14:07:09Z",
		"source": "repositorio.ufc.br",
		"title": "Recomendações de usabilidade para inclusão da terceira idade como meio de facilitação do processo cognitivo",
		"URL": "http://www.repositorio.ufc.br/handle/riufc/68515",
		"publisher": {
			"name": "Repositório UFC",
			"url": "http://www.repositorio.ufc.br/"
		},
		"author": [
			{
				"family": "Silva",
				"given": "Railson Inácio",
				"dropping-particle": "da"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2023",
					7,
					15
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2022"
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/1zHodGHj/items/BZR7LXI4",
		"type": "article-journal",
		"container-title": "IEEE Transactions on Software Engineering",
		"DOI": "10.1109/TSE.2022.3172654",
		"ISSN": "0098-5589, 1939-3520, 2326-3881",
		"issue": "3",
		"journalAbbreviation": "IIEEE Trans. Software Eng.",
		"page": "1152-1170",
		"source": "DOI.org (Crossref)",
		"title": "Refactoring Test Smells With JUnit 5: Why Should Developers Keep Up-to-Date?",
		"title-short": "Refactoring Test Smells With JUnit 5",
		"URL": "https://ieeexplore.ieee.org/document/9769994/",
		"volume": "49",
		"publisher": {
			"name": "IEEE Xplore",
			"url": "https://ieeexplore.ieee.org/Xplore/"
		},
		"author": [
			{
				"family": "Soares",
				"given": "Elvys"
			},
			{
				"family": "Ribeiro",
				"given": "Márcio"
			},
			{
				"family": "Gheyi",
				"given": "Rohit"
			},
			{
				"family": "Amaral",
				"given": "Guilherme"
			},
			{
				"family": "Santos",
				"given": "André"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2023",
					8,
					2
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2023",
					3,
					1
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/local/1zHodGHj/items/SZ4UGUFW",
		"type": "article-journal",
		"abstract": "Teste de unidade é um tipo específico de teste que lida com as menores unidades do sistema. Ele representa o primeiro teste após a implementação do componente. Quando a implementação dos testes de unidade não segue boas práticas, é provável que anti-padrões sejam introduzidos no código. Anti-padrões nos testes, também conhecidos como test smells, são más decisões para projetar e implementar código de teste. Os test smells prejudicam a qualidade do código de teste e reduzem a capacidade de os desenvolvedores interagirem com o código de teste,  o que dificulta a compreensão, leitura e, consequentemente, a manutenibilidade e evolução do sistema. Uma estratégia para remover test smells é a refatoração do código de teste. Poucos estudos na literatura oferecem suporte automatizado para a detecção e refatoração de test smells em projetos Java com o framework JUnit. Assim, o presente estudo fornece uma abordagem semi-automatizada para auxiliar a identificação de test smells e sugerir refatorações para o código de teste em projetos que utilizam as tecnologias Java e JUnit. A abordagem proposta é apoiada pela ferramenta RAIDE, desenvolvida de modo integrado ao Eclipse IDE, para lidar com código de teste desenvolvido em Java. O RAIDE oferece suporte a dois test smells: Assertion Roulette e Duplicate Assert. Apesar de existir outras ferramentas capazes de identificar test smells, até onde sabemos, ainda não há evidências de ferramentas que forneçam suporte automatizado a refatoração de test smells. Além disso, as ferramentas existentes não fornecem interfaces amigáveis e integradas a uma IDE para a identificação de test smells. Para avaliar como a abordagem proposta pode contribuir com a melhoria na qualidade do código de teste, realizamos um estudo experimental. Comparamos nossa ferramenta com o estado da arte e verificamos que o uso da abordagem RAIDE possibilitou a  identificação de test smells de forma mais fácil e rápida. Além disso, RAIDE também se mostrou eficiente na refatoração de métodos de teste. Como RAIDE é uma ferramenta integrada ao Eclipse IDE, os processos de identificação e refatoração são mais rápidos e intuitivos em comparação com o estado da arte e a refatoração manual,uma vez que com o RAIDE é possível realizar a identificação de test smells e a refatoração com alguns cliques em apenas alguns segundos.",
		"language": "pt_BR",
		"license": "Acesso Aberto",
		"note": "Accepted: 2021-06-22T17:23:05Z\npublisher: Universidade Federal da Bahia",
		"source": "repositorio.ufba.br",
		"title": "RAIDE: uma abordagem semi-automatizada para identificação e refatoração de test smells",
		"title-short": "RAIDE",
		"URL": "https://repositorio.ufba.br/handle/ri/33621",
		"publisher": {
			"name": "Repositório UFBA",
			"url": "https://repositorio.ufba.br/"
		},
		"author": [
			{
				"family": "Santana",
				"given": "Railana dos Santos"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2023",
					9,
					14
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2021",
					6,
					22
				]
			]
		}
	}
]